Tekla Open API Reference for Tekla Structures 2025
DPMPrinterAttributes Class
 The DPMPrinterAttributes class contains the attributes for controlling the printing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.DPMPrinterAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class DPMPrinterAttributes : GenericAttributesBase
Public NotInheritable Class DPMPrinterAttributes
	Inherits GenericAttributesBase
The DPMPrinterAttributes type exposes the following members.
Constructors
Name | Description
DPMPrinterAttributes
 Creates a new PrintAttributes instance.
Top
Properties
Name | Description
ColorMode
 Output color mode.
NumberOfCopies
 The number of copies of each drawing to print. Only applicable for printing to a printer.
OpenFileWhenFinished
 Whether to open file when finished.
Orientation
 The print orientation type.
OutputFileName
 Output file name and path. Applicable in PDF printing.
OutputType
 The printing output type.
PaperSize
 The paper size name.
PrinterName
 The printer name.
PrintToMultipleSheet
 Whether to print to multiple sheets.
ScaleFactor
 The print scale factor.
ScalingMethod
 The print scaling method.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace